Repository: warefab/scratch-n-sketch
Catalog: apps/scratch/scratch 2.0 offline/locale/ht.po
Languages: ht

source: Language-Name
ht: Kreyòl

source: %b and %b
ht: %b ak %b

source: %b or %b
ht: %b oubyen %b

source: %m.attribute of %m.spriteOrStage
ht: %m.attribute nan %m.spriteOrStage

source: %m.list contains %s
ht: %m.list sa gen %s ladan

source: %m.mathOp of %n
ht: %m.mathOp sou %n

source: %m.sensor sensor value
ht: %m.sensor valè sennsò

source: add %s to %m.list
ht: mete %s sou %m.list

source: answer
ht: repons

source: ask %s and wait
ht: mande %s epi tann

source: backdrop #
ht: # fon ekran

source: backdrop name
ht: non fon an

source: broadcast %m.broadcast
ht: voye bay tout moun %m.broadcast

source: broadcast %m.broadcast and wait
ht: voye bay tout moun %m.broadcast epi tann

source: change %m.effect effect by %n
ht: mete %m.effect nan plas %n

source: change %m.var by %n
ht: mete %m.var nan plas %n

source: change pen color by %n
ht: ranplase koulè plim avek %n

source: change pen shade by %n
ht: ranplase entansite plim ak %n

source: change pen size by %n
ht: ranplase gwosè pwent plim nan avek %n

source: change size by %n
ht: ranplase gwosè a avek %n

source: change tempo by %n
ht: ranplase tempo ak %n

source: change volume by %n
ht: mete volim la sou %n

source: change x by %n
ht: mete %n nan plas x

source: change y by %n
ht: mete %n nan plas y

source: clear
ht: efase tout

source: clear graphic effects
ht: retire efè grafik yo

source: color %c is touching %c?
ht: koulè %c touche %c

source: Control
ht: Kontwòl

source: costume #
ht: degizman #

source: create clone of %m.spriteOnly
ht: kreye marasa %m.spriteOnly

source: current %m.timeAndDate
ht: kounye a %m.timeAndDate

source: Data
ht: Done

source: days since 2000
ht: jou depi 2000

source: define
ht: defini

source: delete %d.listDeleteItem of %m.list
ht: efase %d.listDeleteItem nan %m.list

source: delete this clone
ht: efase marasa

source: direction
ht: direksyon

source: distance
ht: distans

source: distance to %m.spriteOrMouse
ht: distans jiska %m.spriteOrMouse

source: else
ht: sinon

source: Events
ht: Evènman

source: forever
ht: repete nèt ale

source: glide %n secs to x:%n y:%n
ht: glise pandan %n segond ale nan pozisyon x:%n y:%n

source: go back %n layers
ht: retounen %n kouch

source: go to %m.spriteOrMouse
ht: ale nan %m.spriteOrMouse

source: go to front
ht: ale sou devan

source: go to x:%n y:%n
ht: ale nan pozisyon x:%n y:%n

source: hide
ht: kache

source: hide list %m.list
ht: kache lis %m.list

source: hide variable %m.var
ht: kache varyab %m.var

source: if %b then
ht: si %b enben

source: if on edge, bounce
ht: mate si li rive sou bo a

source: insert %s at %d.listItem of %m.list
ht: mete %s nan pozisyon %d.listItem nan %m.list

source: item %d.listItem of %m.list
ht: eleman %d.listItem nan %m.list

source: join %s %s
ht: mete %s %s ansanm

source: key %m.key pressed?
ht: touch %m.key peze?

source: length of %m.list
ht: longè mo a %m.list

source: length of %s
ht: longè mo a %s

source: letter %n of %s
ht: lèt nimewo %n pami %s

source: Looks
ht: Aparans

source: loudness
ht: volim son

source: More Blocks
ht: Lòt blok

source: Motion
ht: Mouvman

source: mouse down?
ht: sourit peze?

source: mouse x
ht: souri x

source: mouse y
ht: souri y

source: move %n steps
ht: fè %n pa devan

source: next backdrop
ht: pwochen fon ekran

source: next costume
ht: pwochenn degizman

source: not %b
ht: non %b

source: Operators
ht: Operasyon

source: Pen
ht: Plim

source: pen down
ht: bese plim la

source: pen up
ht: leve plim la

source: pick random %n to %n
ht: chwazi yon chif pa aza ant %n ak %n

source: play drum %d.drum for %n beats
ht: bat tanbou%d.drum pou %n frap

source: play note %d.note for %n beats
ht: jwe nòt %d.note pou %n frap

source: play sound %m.sound
ht: Jwe son %m.sound la

source: play sound %m.sound until done
ht: jwe son %m.sound la nèt

source: point in direction %d.direction
ht: vize nan direksyon %d.direction

source: point towards %m.spriteOrMouse
ht: vize %m.spriteOrMouse

source: repeat %n
ht: repete %n fwa

source: repeat until %b
ht: repete jiska %b

source: replace item %d.listItem of %m.list with %s
ht: ranplase %d.listItem nan %m.list avek %s

source: reset timer
ht: rekòmanse mont la

source: rest for %n beats
ht: poze pou %n frap

source: round %n
ht: awondi %n

source: say %s
ht: di %s

source: say %s for %n secs
ht: di %s pandan %n segond

source: Sensing
ht: Detektè

source: sensor %m.booleanSensor?
ht: sennsò %m.booleanSensor?

source: set %m.effect effect to %n
ht: mete efè %m.effect a sou %n

source: set %m.var to %s
ht: mete %m.var sou %s

source: set instrument to %d.instrument
ht: mete enstriman an sou %d.instrument

source: set %m.motor2 direction to %m.motorDirection
ht: mete direksyon %m.motor2 a %m.motorDirection

source: set %m.motor power to %n
ht: mete fòs %m.motor a sou %n

source: set pen color to %c
ht: mete koulè plim la sou %c

source: set pen color to %n
ht: mete koulè plim la sou %n

source: set pen shade to %n
ht: mete entansite plim nan sou %n

source: set pen size to %n
ht: mete gwosè plim la sou %n

source: set rotation style %m.rotationStyle
ht: mete estil wotasyon %m.rotationStyle

source: set size to %n%
ht: mete gwosè a sou %n%

source: set tempo to %n bpm
ht: mete tempo a sou %n bpm

source: set video transparency to %n%
ht: mete transparans videyo sou %n%

source: set volume to %n%
ht: mete volim la sou %n%

source: set x to %n
ht: mete x sou %n

source: set y to %n
ht: mete y sou %n

source: show
ht: montre

source: show list %m.list
ht: montre lis %m.list

source: show variable %m.var
ht: montre varyab %m.var

source: size
ht: gwosè

source: Sound
ht: son

source: stamp
ht: mete so

source: stop %m.stop
ht: kanpe %m.stop

source: stop all sounds
ht: koupe tout son

source: switch backdrop to %m.backdrop
ht: chanje fon pou %m.backdrop

source: switch backdrop to %m.backdrop and wait
ht: chanje fon pou %m.backdrop epi tann

source: switch costume to %m.costume
ht: chanje degizman pou %m.costume

source: tempo
ht: tèmpo

source: think %s
ht: panse ak %s

source: think %s for %n secs
ht: panse ak %s pandan %n segond

source: tilt
ht: panche

source: timer
ht: kronomèt

source: touching %m.touching?
ht: ap manyen %m.touching?

source: touching color %c?
ht: ap manyen koulè %c?

source: turn @turnLeft %n degrees
ht: vire @turnLeft %n degre

source: turn @turnRight %n degrees
ht: vire @turnRight %n degre

source: turn %m.motor off
ht: etenn %m.motor

source: turn %m.motor on
ht: estat %m.motor

source: turn %m.motor on for %n secs
ht: estat %m.motor pandan %n segonn

source: turn video %m.videoState
ht: vire video %m.videoState

source: username
ht: non itilizatè

source: video %m.videoMotionType on %m.stageOrThis
ht: videyo %m.videoMotionType sou %m.stageOrThis

source: volume
ht: volim

source: wait %n secs
ht: tann %n segond

source: wait until %b
ht: tann jouk %b

source: when %m.booleanSensor
ht: lè %m.booleanSensor

source: when %m.key key pressed
ht: lè yo peze touch %m.key

source: when %m.sensor %m.lessMore %n
ht: lè %m.sensor %m.lessMore %n

source: when %m.triggerSensor > %n
ht: lè %m.triggerSensor > %n

source: when @greenFlag clicked
ht: lè yo klike @greenFlag

source: when backdrop switches to %m.backdrop
ht: lè fon an chanje %m.backdrop

source: when distance %m.lessMore %n
ht: lè distans %m.lessMore %n

source: when I receive %m.broadcast
ht: lè m resevwa %m.broadcast

source: when I start as a clone
ht: lè m parèt kòm marasa

source: when this sprite clicked
ht: lè ti tonton an klike

source: when tilt %m.eNe %n
ht: lè panche %m.eNe %n

source: x position
ht: pozisyon x

source: y position
ht: pozisyon y

source: set motor direction %m.motorDirection
ht: mete direksyon %m.motorDirection

source: set motor power %n
ht: mete fòs motè a sou %n

source: turn motor off
ht: etenn motè

source: turn motor on
ht: estat motè

source: turn motor on for %n secs
ht: estat motè pandan %n segonn

source: when distance < %n
ht: lè distans < %n

source: when tilt = %n
ht: lè panche = %n

source: %m.list contains %s?
ht: %m.list sa gen %s ladan?

source: A connected
ht: konekte A

source: About
ht: Osijè

source: Add
ht: Ajoute

source: Add an Extension
ht: Ajoute lòt moso

source: all
ht: tout

source: All
ht: Tout

source: all around
ht: laviwon

source: Animal
ht: Zannimo

source: Animals
ht: Zanimo

source: asin
ht: sinis envès

source: atan
ht: tanjant envès

source: B connected
ht: konekte B

source: backdrop
ht: fon

source: Backdrop
ht: Fon

source: backdrop1
ht: fon1

source: backdrops
ht: fon yo

source: Backdrops
ht: Fon yo

source: Backpack
ht: Malèt

source: Bass
ht: Bas

source: Bass Drum
ht: Bas Tanbou

source: Bassoon
ht: Bason

source: Bitmap
ht: Tipwen tipwen

source: Bitmap Mode
ht: Mòd Tipwen Tipwen

source: Block help
ht: Èd sou blok

source: brightness
ht: nivo limyè

source: Bring to front
ht: Mete tout devan

source: Broadcast
ht: Pibliye

source: Brush
ht: Penso

source: button pressed
ht: bouton peze

source: by
ht: ekri pa

source: C connected
ht: konekte C

source: Camera
ht: Kamera

source: Cancel
ht: Anile

source: Cannot Delete
ht: Pa ka anile

source: Can’t find network connection or reach server.
ht: Pa gen koneksyon.

source: Castle
ht: Chato

source: Category
ht: Kategori

source: ceiling
ht: plafon

source: Cello
ht: Vyolonsèl

source: Choir
ht: Koral

source: Choose backdrop from library
ht: Chwazi fon nan koleksyon an

source: Choose costume from library
ht: Chwazi degizman nan koleksyon an

source: Choose sound from library
ht: Chwazi son nan koleksyon an

source: Choose sprite from library
ht: Chwazi ti tonton nan koleksyon an

source: Circle
ht: Sèk

source: City
ht: Vil

source: Clarinet
ht: Klarinèt

source: Clear
ht: Efase tout

source: clear senders/receivers
ht: efase ekspeditè/resipyandè

source: color
ht: koulè

source: Convert to bitmap
ht: Konvèti an ti pwen ti pwen

source: Convert to vector
ht: Konvèti an vektè

source: Converting mp3...
ht: Konvèti mp3...

source: copy
ht: kopye

source: Costume
ht: Degizman

source: costume name
ht: non degizman

source: costume1
ht: degizman1

source: costume2
ht: degizman2

source: Costumes
ht: Degizman

source: Costumes > 1
ht: Degizman > 1

source: Costumes:
ht: Degizman:

source: Cowbell
ht: Kloch bèf

source: Crash Cymbal
ht: Senbal

source: cut
ht: koupe

source: D connected
ht: konekte D

source: date
ht: jou

source: delete
ht: efase

source: Delete
ht: Efase

source: delete variable
ht: efase varyab

source: direction:
ht: direksyon:

source: don't rotate
ht: pa vire

source: Don't save
ht: Pa sere

source: down
ht: anba

source: down arrow
ht: flèch anba

source: Download
ht: Telechaje

source: Download to your computer
ht: Telechaje sou òdinatè ou

source: duplicate
ht: kopye

source: Duplicate
ht: Kopye

source: edge
ht: arebò

source: Edit
ht: Korije

source: edit
ht: korije

source: Effects
ht: Varyasyon son

source: Electric Guitar
ht: Gita elektrik

source: Electric Piano
ht: Pyano Elektrik

source: Fantasy
ht: Imajinè

source: File
ht: Fichye

source: fisheye
ht: je pwason

source: Flute
ht: Flit

source: Flying
ht: Vole

source: ghost
ht: fantom

source: Guitar
ht: Gita

source: Hand Clap
ht: Bravo

source: Holiday
ht: Fèt

source: import
ht: enpote

source: Import
ht: Enpote

source: Importing sound...
ht: Tann...

source: last
ht: dènye

source: left
ht: goch

source: left arrow
ht: flèch goch

source: left-right
ht: goch-dwat

source: light
ht: limyè

source: list
ht: lis

source: Make a Block
ht: Fè yon Blòk

source: Make a List
ht: Fè w lis

source: Make a Variable
ht: Fè w varyab

source: meow
ht: myaw

source: Message Name
ht: Non Mesaj

source: message1
ht: mesaj1

source: Microphone volume:
ht: Volim mikro:

source: mosaic
ht: mozayik

source: motion
ht: mouvman

source: mouse-pointer
ht: flèch souri a

source: Music and Dance
ht: Mizik ak Dans

source: Music Box
ht: bwat mizik

source: Music Loops
ht: Repetisyon Mizik

source: New
ht: Nouvo

source: New backdrop from camera
ht: Nouvo fon pami foto pa ou

source: New backdrop:
ht: Nouvo fon:

source: New costume from camera
ht: Nouvo degizman soti nan kamera

source: New costume:
ht: Nouvo degizman:

source: New List
ht: Nouvo Lis

source: New Message
ht: Nouvo Mesaj

source: New name
ht: Nouvo non

source: New sound:
ht: Nouvo son:

source: New sprite from camera
ht: Nouvo ti tonton nan kamera

source: New sprite:
ht: Yon lòt ti tonton:

source: New Variable
ht: Nouvo varyab

source: off
ht: fèmen

source: on
ht: limen

source: Organ
ht: Òg

source: Paint new backdrop
ht: Desinen nouvo fon

source: Paint new costume
ht: Pentire yon nouvo degizman

source: Paint new sprite
ht: Pentire yon nouvo ti tonton

source: Password
ht: Modpas

source: Password is required
ht: Modpas obligatwa

source: paste
ht: kole

source: Pencil
ht: Kreyon

source: People
ht: Moun

source: Piano
ht: Pyano

source: Pizzicato
ht: Pizikato

source: previous backdrop
ht: fon anvan an

source: random
ht: pa aza

source: Record
ht: Anrejistre

source: Record new sound
ht: Anrejistre nouvo son

source: record...
ht: anrejistre...

source: recording1
ht: anrejistreman1

source: Rectangle
ht: Rektang

source: Redo
ht: Refè

source: redo
ht: refè

source: Remixing...
ht: Tann...

source: rename variable
ht: chanje non varyab

source: resistance-A
ht: rezistans-A

source: resistance-B
ht: rezistans-B

source: resistance-C
ht: rezistans-C

source: reverse
ht: fè bak

source: Revert
ht: Retounen

source: Reverting...
ht: Tand...

source: right
ht: dwat

source: right arrow
ht: flèch dwat

source: Save
ht: Sere

source: Save as
ht: Sere kòm

source: Save as a copy
ht: Sere an kopi

source: Save now
ht: Sere touswit

source: Save project?
ht: Sere pwojè a?

source: save to local file
ht: sere nan òdinatè a

source: Saving changes...
ht: Tann...

source: Saxophone
ht: Saksofòn

source: Script
ht: Eskriptaj

source: Scripts
ht: Eskriptaj

source: Share
ht: Pataje

source: Share to website
ht: Pataje ak sit

source: shared
ht: pa pou tout moun

source: show:
ht: montre:

source: Sign in
ht: Enskripsyon

source: Sign in to save
ht: Enskri pou sere

source: Sign out
ht: Dekonekte

source: sin
ht: sinis envès

source: slider
ht: glisè

source: sound
ht: son

source: Sounds
ht: Son

source: Space
ht: Espas

source: space
ht: espas

source: Sports
ht: Espò

source: Sprite
ht: Ti tonton yo

source: Sprite1
ht: Ti tonton yo 1

source: Sprites
ht: Ti tonton yo

source: sqrt
ht: rasin

source: Stage
ht: Sèn

source: Stage selected:
ht: Sèn ki chwazi:

source: Steel Drum
ht: Tanbou Dwoum

source: Synth Lead
ht: Son Metal

source: Synth Pad
ht: Son Metal Dous

source: Tambourine
ht: Tanbou

source: tan
ht: tanjant envès

source: text
ht: tèks

source: Text
ht: Tèks

source: that way
ht: lòt bò a

source: Theme
ht: Tèm

source: Things
ht: Bagay

source: this sprite
ht: ti tonton sa a

source: this way
ht: lòt bò a

source: Tips
ht: Poul

source: Transportation
ht: Transpò

source: Triangle
ht: Triyang

source: Trombone
ht: Twonbòn

source: Type
ht: Tipe

source: Undelete
ht: Efase

source: Underwater
ht: Anba Dlo

source: undo
ht: anile

source: Undo
ht: Anile

source: Undo Revert
ht: Defèt

source: unshared
ht: pa pou tout moun

source: up
ht: anwo

source: up arrow
ht: flèch anwo

source: Upload backdrop from file
ht: Ranmase fon nan koleksyon an

source: Upload from your computer
ht: Telechaje

source: Upload sound from file
ht: Telechaje son

source: Upload sprite from file
ht: Telechaje ti titon

source: Uploading image...
ht: Tan...

source: Uploading sound...
ht: Tan...

source: Uploading sprite...
ht: Tan...

source: variable
ht: varyab

source: Variable name
ht: Non varyab

source: Vector
ht: Vektè

source: Vector Mode
ht: Mod Vektè

source: Vibraphone
ht: Vibrafòn

source: video direction
ht: videyo direksyon

source: video motion
ht: videyo mouvman

source: Video on:
ht: Videyo:

source: Walking
ht: Mache

source: Want to save? Click remix
ht: Vle sove? Klike sou Remix

source: whirl
ht: toubiyon

source: Wooden Flute
ht: Flit bwa

source: year
ht: ane

source: All Tips
ht: Tout poul

source: Save Project
ht: Sere Pwojè

source: Share to Scratch Website
ht: Pataje ak sit Scratch

source: any
ht: nenpòt
